
/*. Дано целое число N (> 0). С помощью операций деления нацело
и взятия остатка от деления определить, имеются ли в записи числа N
нечетные цифры. Если имеются, то вывести TRUE, если нет — вывести
FALSE.
*/


//  !Увага! дисклеймер.
//"конкретно це завдання я виконав не повністю самостійно, а за допомогую ChatGPT, але він не зробив все за мене,
//я нічого не копіював через Ctrl C - Ctrl - V, я все з чим отримав допомогу, переписував самостійно щоб краще запамятати,
//намагався модернізувати та видозмінити код,
//тим більше ChatGPT не генерував весь цей код, а леше деякі ключові елементи що я не знав, і не міг написати без додаткової підтримки."
//  !Увага!



Console.OutputEncoding = System.Text.Encoding.Default; //lg Ukraine

Console.WriteLine("Будьласка в ведіть значення " + "N ");
int N = Convert.ToInt16(Console.ReadLine()); //Долучаємо значеня до переменої N.

bool StopWhileRestarted = false;

while (N > 0)
{
    int digit = N % 10;

        if (digit %2 != 0)
        {
            StopWhileRestarted |= true;
            Console.WriteLine("TRUE");
                break; //якщо тут true то цикол зупинитця.

    }
        else
        {
            Console.WriteLine("FALSE");
            StopWhileRestarted |= true;
                break; //якщо тут true то цикол зупинитця.
        }

}